App/SprayCombustion/sprayH_2mm_O2_15/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 -25 0)
    (108 -25 0)
    (108 25 0)
    (0 25 0)
    (0 -25 50)
    (108 -25 50)
    (108 25 50)
    (0 25 50)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (54 25 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sideWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (1 5 4 0)
        );
    }
    liner
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    piston
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    cylinderHead
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
