App/SprayCombustion/sprayH_2mm_O2_15/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
	{
   	  	 name rightWall;
	  	 patchInfo
		 {
					type cyclic;
					transform rotational;
					neighbourPatch leftWall;
					rotationAxis (0 0 1);
					rotationCentre (0 0 0);
					matchTolerance	0.01;
		 }

			  constructFrom patches;
			  patches (right);
	}

	{
		name leftWall;
		patchInfo
		{
					type cyclic;
					transform rotational;
					neighbourPatch rightWall;
					rotationAxis (0 0 1);
					rotationCentre (0 0 0);
					matchTolerance 0.01;
		 }

			  constructFrom patches;
			  patches	(left);
	}

);
