App/SprayCombustion/sprayH_2mm_O2_15/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sideWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3325;
        startFace       97925;
    }
    liner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          625;
        startFace       101250;
    }
    piston
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1350;
        startFace       101875;
    }
    cylinderHead
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1350;
        startFace       103225;
    }
)

// ************************************************************************* //
