App/SprayCombustion/sprayH_2mm_O2_15/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   speedCHEM; //ode
    chemistryThermo   psi;
}

chemistry       on;

initialChemicalTimeStep 1e-8; //07
odeCoeffs
{
     solver          seulex;
     eps             0.05;
}

speedCHEMCoeffs
{
}


// ************************************************************************* //
