App/SprayCombustion/sprayH_2mm_O2_15/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//combustionModel CTC<psiChemistryCombustion> ;
combustionModel laminar<psiChemistryCombustion> ;

active          on;

laminarCoeffs
{}

CTCCoeffs
{
   Ctau_t              0.01; //default 0.1
   Cmix                0.1; //default 1
   turbulentReaction   yes;
   Y_CO2_0              0.011;   //0.011aaa
   Y_H2O_0              0.0;
   fuelName             diesel_surrogate;
}

PaSRCoeffs
{
   //Cmix                1.0; //default 1
   Ctau_t                0.1; //default 1
  turbulentReaction   yes;
}


// ************************************************************************* //
