App/SprayCombustion/sprayH_2mm_O2_15/constant/injProfile
(	0.000000	0.000	)
(	0.000014	0.486	)
(	0.000030	1.042	)
(	0.000046	1.598	)
(	0.000062	2.154	)
(	0.000078	2.648	)
(	0.000094	2.702	)
(	0.000110	2.702	)
(	0.000126	2.702	)
(	0.000142	2.702	)
(	0.000158	2.702	)
(	0.000174	2.702	)
(	0.000190	2.702	)
(	0.000206	2.702	)
(	0.000222	2.702	)
(	0.000238	2.702	)
(	0.000254	2.702	)
(	0.000270	2.702	)
(	0.000286	2.702	)
(	0.000302	2.702	)
(	0.000318	2.702	)
(	0.000334	2.702	)
(	0.000350	2.702	)
(	0.000366	2.702	)
(	0.000382	2.702	)
(	0.000398	2.702	)
(	0.000414	2.702	)
(	0.000430	2.702	)
(	0.000446	2.702	)
(	0.000462	2.702	)
(	0.000478	2.702	)
(	0.000494	2.702	)
(	0.000510	2.702	)
(	0.000526	2.702	)
(	0.000542	2.702	)
(	0.000558	2.702	)
(	0.000574	2.702	)
(	0.000590	2.702	)
(	0.000606	2.702	)
(	0.000622	2.702	)
(	0.000638	2.702	)
(	0.000654	2.702	)
(	0.000670	2.702	)
(	0.000686	2.702	)
(	0.000702	2.702	)
(	0.000718	2.702	)
(	0.000734	2.702	)
(	0.000750	2.702	)
(	0.000766	2.702	)
(	0.000782	2.702	)
(	0.000798	2.702	)
(	0.000814	2.702	)
(	0.000830	2.702	)
(	0.000846	2.702	)
(	0.000862	2.702	)
(	0.000878	2.702	)
(	0.000894	2.702	)
(	0.000910	2.702	)
(	0.000926	2.702	)
(	0.000942	2.702	)
(	0.000958	2.702	)
(	0.000974	2.702	)
(	0.000990	2.702	)
(	0.001006	2.702	)
(	0.001022	2.702	)
(	0.001038	2.702	)
(	0.001054	2.702	)
(	0.001070	2.702	)
(	0.001086	2.702	)
(	0.001102	2.702	)
(	0.001118	2.702	)
(	0.001134	2.702	)
(	0.001150	2.702	)
(	0.001166	2.702	)
(	0.001182	2.702	)
(	0.001198	2.702	)
(	0.001214	2.702	)
(	0.001230	2.702	)
(	0.001246	2.702	)
(	0.001262	2.702	)
(	0.001278	2.702	)
(	0.001294	2.702	)
(	0.001310	2.702	)
(	0.001326	2.702	)
(	0.001342	2.702	)
(	0.001358	2.702	)
(	0.001374	2.702	)
(	0.001390	2.702	)
(	0.001406	2.702	)
(	0.001422	2.702	)
(	0.001438	2.702	)
(	0.001454	2.702	)
(	0.001470	2.702	)
(	0.001486	2.702	)
(	0.001502	2.702	)
(	0.001518	2.702	)
(	0.001534	2.702	)
(	0.001550	2.702	)
(	0.001566	2.702	)
(	0.001582	2.702	)
...
(	100	0.00	)
