App/SprayCombustion/sprayH_2mm_O2_15/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;           //false
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.05;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


constantProperties
{
    T0                373;

    // place holders for rho0 and Cp0
    // - reset from liquid properties using T0
   
    rho0            650.0;
    Cp0             4187;
    
    constantVolume  false;
}

sdx 0.1;
sdy 0.0; 
sdz 0.0;

npz 0.025;

//crank top base 計算の0CAは実験の1.CA
SOI_3  1e-08;

massTotal_3 1.78e-05;

duration_3 6.9e-03;

parcelsPerSecond_3 5e7;

subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {
        main
        {
            type            coneNozzleInjection;
            SOI             $SOI_3;
            massTotal       $massTotal_3;
            parcelBasisType mass;
            injectionMethod point;
            flowType        flowRateAndDischarge;
            outerDiameter   0.1e-3;
            innerDiameter   0;
            duration        $duration_3;
            position        (  0.0025 0  $npz );  
            direction       (  $sdx 0 0 );
            parcelsPerSecond $parcelsPerSecond_3;
            flowRateProfile table
            (
                #include "injProfile"
            );

            Cd              constant 0.8;

            thetaInner      constant 0;
            thetaOuter      constant 13.0;

            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value 0.1e-3;
                }
            }
        }
    }

    dispersionModel none;           //stochasticDispersionRAS

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;     //none

    compositionModel singlePhaseMixture;

    phaseChangeModel liquidEvaporationBoil;     //none

    surfaceFilmModel none;

    atomizationModel none;

    breakupModel    WAVEMTAB;       //ReitzKHRT     //none

    stochasticCollisionModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                NC7H16      1.0;
            }
        );
    }

    liquidEvaporationBoilCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids    
        ( 
            NC7H16
        );
    }

    ReitzDiwakarCoeffs
    {
        solveOscillationEq yes;
        Cbag            6;
        Cb              0.785;
        Cstrip          0.5;
        Cs              10;
    }


    ReitzKHRTCoeffs
    {
        solveOscillationEq yes;
        B0              0.61;
        B1              20; 
        Ctau            1;  
        CRT             0.1;
        msLimit         0.2;
        WeberLimit      6;
    }

    TABCoeffs
    {
        y0              0;
        yDot0           0;
        Cmu             10;
        Comega          8;
        WeCrit          12;
    }


   WAVEMTABCoeffs
     {
          solveOscillationEq yes;
          y0              0;
          yDot0           0;
          Cmu             10;
          Comega          8;
          WeCrit          12;
          SMDCalculationMethod method1;
          B0              0.61;
          B1              20;  
          Ctau            1;
          CRT             0.1;
          msLimit         0.03;
          WeberLimit      6;
      }
}


cloudFunctions
{}


// ************************************************************************* //
