App/SprayCombustion/sprayH_2mm_O2_15/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1000;

boundaryField
{
    cylinderHead
    {
        type            zeroGradient;
    }
    liner
    {
        type            zeroGradient;
    }
    piston
    {
        type            zeroGradient;
    }
    sideWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
