App/SprayCombustion/sprayH_2mm_O2_15/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    cylinderHead
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.5;
    }
    liner
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.5;
    }
    piston
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.5;
    }
    sideWall
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.5;
    }
}


// ************************************************************************* //
