App/SprayCombustion/sprayH_2mm_O2_15/0/rId
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rId;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform -100;

boundaryField
{
    cylinderHead
    {
        type            calculated;
        value           uniform -100;
    }
    liner
    {
        type            calculated;
        value           uniform -100;
    }
    piston
    {
        type            calculated;
        value           uniform -100;
    }
    sideWall
    {
        type            calculated;
        value           uniform -100;
    }
}


// ************************************************************************* //
