App/SprayCombustion/sprayH_2mm_O2_15/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

  rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-07;
        //tolerance       1e-08;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
/*
  p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
*/
   p
      {
          solver          PCG;
          preconditioner  DIC;
          //tolerance       1e-06;
          tolerance       0;
          relTol          0.01;
      }


    pFinal
    {
        $p;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

  "(Yi|O2|N2|H2O)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        //tolerance       1e-7;
        //tolerance       1e-8;
        tolerance       1e-10;
        relTol          0;
    }

    h
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    hFinal
    {
        $h;
        //tolerance       1e-7;
        tolerance       1e-8;
        relTol          0;
    }


    "(M0|M1|M2|M3|M4|M5)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;  //1e-10
        relTol          0;
    }
    "(M0|M1|M2|M3|M4|M5)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }






}

PIMPLE
{

// engineFoam
    nCorrectors     2;  //default 2!!!
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;  //yes


// sprayFoam
/*    transonic       no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
*/
}

relaxationFactors
{
    fields
    {
        ".*Final"       1;
        p               0.5;
    }
    equations
    {
        ".*Final"       1;
        U               0.5;
        Yi              0.5;
        h               0.5;
    }
}


// ************************************************************************* //
